app/views/groups/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "members" ON "users"."id" = "members"."user_id" WHERE "members"."group_id" = $1  [["group_id", 2]]
---
    <div>
      <% @group.users.each do |member| %>