app/views/groups/show.html.erb

    <div>
      <% @group.members.each do |member| %>
---
SELECT "members".* FROM "members" WHERE "members"."group_id" = $1  [["group_id", 1]]