app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
---
<div id="comment-list" data-comment-target="commentList" class="flex flex-col">
  <% @post.comments.includes(:user).each do |comment| %>