app/controllers/comments_controller.rb

UPDATE "comments" SET "text" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["text", "mustapha edited"], ["updated_at", "2022-12-24 21:14:15.079314"], ["id", 13]]
---
  def update
    @comment = Comment.find(params[:id])

    if @comment.update(params.require(:comment).permit(:text))

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy