app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    puts 'new comment'
    puts 'new comment'
    puts 'new comment'
    puts 'new comment'
    puts 'new comment'
    puts 'new comment'
    puts 'new comment'
    puts 'new comment'
    puts 'new comment'

    # @comment = Comment.new
    @post = Post.find(params[:post_id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "parent_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["parent_id", nil], ["text", "fffffffffffffff"], ["created_at", "2022-12-24 12:52:20.902985"], ["updated_at", "2022-12-24 12:52:20.902985"]]
---
  def create
    @comment = Comment.new(comment_params)
    @group = Group.find(params[:group_id])
    @post = Post.find(params[:post_id])
    respond_to do |format|
      format.html do
        if @comment.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def create_reply
    @comment = Comment.new(comment_params)
    @group = Group.find(params[:group_id])
    @post = Post.find(params[:post_id])
    @parent = Comment.find(params[:parent_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "comments" SET "text" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["text", "mustapha edited"], ["updated_at", "2022-12-24 21:14:15.079314"], ["id", 13]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @comment = Comment.find(params[:id])

    if @comment.update(params.require(:comment).permit(:text))
      flash[:success] = 'Comment successfully updated!'
      @post = @comment.post
      @group = @post.group

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
    @user = current_user
    @user.save
    @post = @comment.post
    @post.save
    @group = @post.group