app/controllers/groups_controller.rb

SELECT "members".* FROM "members" WHERE "members"."user_id" = $1 AND "members"."group_id" = $2 ORDER BY "members"."id" ASC LIMIT $3  [["user_id", 5], ["group_id", 1], ["LIMIT", 1]]
---
   def check_if_member(group)
      @group = group
      @member = Member.where(user_id: current_user.id, group_id: @group.id).first

INSERT INTO "members" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["group_id", 7], ["created_at", "2022-12-25 08:38:22.863415"], ["updated_at", "2022-12-25 08:38:22.863415"]]
INSERT INTO "groups" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["name", "seond Group"], ["created_at", "2022-12-25 08:36:20.731385"], ["updated_at", "2022-12-25 08:36:20.731385"]]
---
    def create

      @group = Group.new(group_params)


      respond_to do |format|
          format.html do
            if @group.save
              flash[:success] = 'Group created successfully'
              redirect_to user_group_path(current_user, @group)
            else
              flash.now[:error] = 'Error: Group could not be created'
              redirect_to new_user_group_path(current_user)
            end
          end
        end
        membersController = MembersController.new
        membersController.request = request
        membersController.response = response
        membersController.create_admin(@group)