app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "groups" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["name", "First Group"], ["created_at", "2022-12-24 08:44:14.460484"], ["updated_at", "2022-12-24 08:44:14.460484"]]
INSERT INTO "members" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["group_id", 1], ["created_at", "2022-12-24 19:38:14.682042"], ["updated_at", "2022-12-24 19:38:14.682042"]]
---
    def join(group)
      @member = Member.new()
      puts group.name
      puts current_user.name
      @group = group
      @user = current_user
      @member.group = @group
      @member.user = @user

      respond_to do |format|
        format.html do
          if @member.save

SELECT "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
        @groups = Group.all

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @group = Group.find(params[:id])

INSERT INTO "groups" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["name", "My Group"], ["created_at", "2022-12-24 22:16:58.136797"], ["updated_at", "2022-12-24 22:16:58.136797"]]
---
    def create
      @group = Group.new(group_params)
      respond_to do |format|
          format.html do
            if @group.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @group = Group.find params[:id]