app/controllers/members_controller.rb

    def create
        @member = Member.new()
        @group = Group.find(params[:group_id])
        @member.group = @group
        @member.user = current_user
        respond_to do |format|
          format.html do
            if @member.save
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "members" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["group_id", 1], ["created_at", "2022-12-25 08:41:13.608074"], ["updated_at", "2022-12-25 08:41:13.608074"]]

      def create_admin(group)
        @member = Member.new()
        @group = group
        @member.group = @group
        @member.user = current_user
        respond_to do |format|
          format.html do
            if @member.save
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "members" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["group_id", 5], ["created_at", "2022-12-25 08:41:05.180833"], ["updated_at", "2022-12-25 08:41:05.180833"]]

      def destroy
        @group = Group.find(params[:group_id])
        @member = Member.includes(:user, :group).find(params[:id])
        @member.delete
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 5]]
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 2]]