app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @group = Group.find(params[:group_id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @group = Group.find(params[:group_id])
    @post = Post.find(params[:id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "group_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 5], ["group_id", 1], ["title", "test post"], ["body", "test body"], ["created_at", "2022-12-24 12:49:37.142694"], ["updated_at", "2022-12-24 12:49:37.142694"]]
---
  def create
    @post = Post.new(post_params)
    @group = Group.find(params[:group_id])
    respond_to do |format|
      format.html do
        if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "ttttttttttttt"], ["body", "iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii"], ["updated_at", "2022-12-24 21:07:32.779270"], ["id", 7]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(params.require(:post).permit(:title, :body))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy
    @user = current_user
    @user.save
    @group = Group.find(params[:group_id])